app/controllers/companies_controller.rb

  def show
    @company = Company.find(params[:id])
    @quotes = Quote.all
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT 1  [["id", 3]]
SELECT "quotes".* FROM "quotes"

  def new

    @companies = Company.all
---
SELECT "companies".* FROM "companies"

  def dashboard
    @companies = Company.all
---
SELECT "companies".* FROM "companies"

  def create

    @company = Company.new(company_params)
    if @company.save
---
INSERT INTO "companies" ("email", "company", "name", "phone", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["email", ""], ["company", ""], ["name", "stuff"], ["phone", ""], ["created_at", "2015-03-19 16:02:02.916077"], ["updated_at", "2015-03-19 16:02:02.916077"]]

  def update
    @company = Company.find(params[:id])
    if @company.update_attributes(company_params)
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "companies" SET "phone" = ?, "updated_at" = ? WHERE "companies"."id" = ?  [["phone", "1234567890"], ["updated_at", "2015-04-07 20:54:40.561355"], ["id", 7]]