app/controllers/employee_email_managers_controller.rb

SELECT "employee_emails".* FROM "employee_emails"
---
  def index
    @emails = EmployeeEmail.all

INSERT INTO "employee_emails" ("name", "email", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Gordon Motsinger"], ["email", "gordon.motsinger@gmail.com"], ["created_at", "2015-03-26 21:03:20.194011"], ["updated_at", "2015-03-26 21:03:20.194011"]]
---
  def create
    @email = EmployeeEmail.new(email_params)

    if @email.save

SELECT  "employee_emails".* FROM "employee_emails" WHERE "employee_emails"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "employee_emails" WHERE "employee_emails"."id" = ?  [["id", 1]]
---
  def destroy
    @email = EmployeeEmail.find(params[:id])
    if @email.present?
      @email.destroy