app/controllers/employees_controller.rb

SELECT "quotes".* FROM "quotes"
SELECT "companies".* FROM "companies"
---
  def index
    session[:employee_company_id] = nil
    @quotes = Quote.all
    @companies = Company.all