app/controllers/quotes_controller.rb

  def show
    @quotes = Quote.find(params[:company_id])
---
SELECT  "quotes".* FROM "quotes" WHERE "quotes"."id" = ? LIMIT 1  [["id", 1]]

  def new
    if session[:current_company_id] == nil
      redirect_to root_path
      flash[:notice] = 'You must fill out information about your company before continuing'
    end
    @quotes = Quote.all
---
SELECT "quotes".* FROM "quotes"

  def edit
    @quote = Quote.find(params[:id])
---
SELECT  "quotes".* FROM "quotes" WHERE "quotes"."id" = ? LIMIT 1  [["id", 5]]

  def create
    @quote = Quote.new(quote_params)
    @quote.company_id = session[:current_company_id]
    @company = Company.find(session[:current_company_id])
    #session[:company_name] = @company.companyname
    if @quote.save
---
SELECT  "companies".* FROM "companies" WHERE "companies"."id" = ? LIMIT 1  [["id", nil]]
INSERT INTO "quotes" ("ad_type", "app_type", "mobile_platform", "budget", "native_ad", "social_ad", "email_campaign", "ovuline_exclusive", "target_ttc", "target_preg", "target_sig_other", "target_1st_trim", "target_2nd_trim", "target_3rd_trim", "begin_date", "end_date", "company_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @quote = Quote.find(params[:id])
---
SELECT  "quotes".* FROM "quotes" WHERE "quotes"."id" = ? LIMIT 1  [["id", 5]]